# GetCircuitByCell Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..GetCircuitByCell Method
PanelScheduleView Class See Also
---
Gets the circuit element for the given slot number
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElectricalSystem GetCircuitByCell(
	int nRow,
	int nCol
)
```

Visual Basic
---
```text
Public Function GetCircuitByCell ( _
	nRow As Integer, _
	nCol As Integer _
) As ElectricalSystem
```

Visual C++
---
```text
public:
ElectricalSystem^ GetCircuitByCell(
	int nRow,
	int nCol
)
```

# ### Parameters
nRow
    Type: System..::..Int32 Row Number of the Body Section
nCol
    Type: System..::..Int32 Column Number of the Body Section
# ### Return Value
The circuit found at the given row and column
# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace